glcloud/keil_v5/ARM/PACK/.Web/SiliconLabs.EFM32TG11B_DFP.pdsc
        <!-- *************************  Device 'EFM32TG11B140F64IM64'  ***************************** -->
        <device Dname="EFM32TG11B140F64IM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B140F64IM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B140F64IM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B140F64IQ48'  ***************************** -->
        <device Dname="EFM32TG11B140F64IQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B140F64IQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B140F64IQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B140F64IQ64'  ***************************** -->
        <device Dname="EFM32TG11B140F64IQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B140F64IQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B140F64IQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32TG11B320">
        <book         name="Documents/efm32tg11_datasheet.pdf"      title="EFM32TG11B320 Data Sheet"/>
        <book         name="Documents/efm32tg11_errata.pdf"         title="EFM32TG11B320 Errata"/>
        <!-- *************************  Device 'EFM32TG11B320F128GM64'  ***************************** -->
        <device Dname="EFM32TG11B320F128GM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B320F128GM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B320F128GM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B320F128GQ48'  ***************************** -->
        <device Dname="EFM32TG11B320F128GQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B320F128GQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B320F128GQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B320F128GQ64'  ***************************** -->
        <device Dname="EFM32TG11B320F128GQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B320F128GQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B320F128GQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B320F128IM64'  ***************************** -->
        <device Dname="EFM32TG11B320F128IM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B320F128IM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B320F128IM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B320F128IQ48'  ***************************** -->
        <device Dname="EFM32TG11B320F128IQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B320F128IQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B320F128IQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B320F128IQ64'  ***************************** -->
        <device Dname="EFM32TG11B320F128IQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B320F128IQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B320F128IQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32TG11B340">
        <book         name="Documents/efm32tg11_datasheet.pdf"      title="EFM32TG11B340 Data Sheet"/>
        <book         name="Documents/efm32tg11_errata.pdf"         title="EFM32TG11B340 Errata"/>
        <!-- *************************  Device 'EFM32TG11B340F64GM64'  ***************************** -->
        <device Dname="EFM32TG11B340F64GM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B340F64GM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B340F64GM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B340F64GQ48'  ***************************** -->
        <device Dname="EFM32TG11B340F64GQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B340F64GQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B340F64GQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B340F64GQ64'  ***************************** -->
        <device Dname="EFM32TG11B340F64GQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B340F64GQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B340F64GQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B340F64IM64'  ***************************** -->
        <device Dname="EFM32TG11B340F64IM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B340F64IM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B340F64IM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B340F64IQ48'  ***************************** -->
        <device Dname="EFM32TG11B340F64IQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B340F64IQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B340F64IQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B340F64IQ64'  ***************************** -->
        <device Dname="EFM32TG11B340F64IQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B340F64IQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B340F64IQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00010000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00010000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32TG11B520">
        <book         name="Documents/efm32tg11_datasheet.pdf"      title="EFM32TG11B520 Data Sheet"/>
        <book         name="Documents/efm32tg11_errata.pdf"         title="EFM32TG11B520 Errata"/>
        <!-- *************************  Device 'EFM32TG11B520F128GM32'  ***************************** -->
        <device Dname="EFM32TG11B520F128GM32">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128GM32"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128GM32.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128GM64'  ***************************** -->
        <device Dname="EFM32TG11B520F128GM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128GM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128GM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128GM80'  ***************************** -->
        <device Dname="EFM32TG11B520F128GM80">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128GM80"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128GM80.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128GQ48'  ***************************** -->
        <device Dname="EFM32TG11B520F128GQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128GQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128GQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128GQ64'  ***************************** -->
        <device Dname="EFM32TG11B520F128GQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128GQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128GQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128GQ80'  ***************************** -->
        <device Dname="EFM32TG11B520F128GQ80">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128GQ80"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128GQ80.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128IM32'  ***************************** -->
        <device Dname="EFM32TG11B520F128IM32">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128IM32"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128IM32.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128IM64'  ***************************** -->
        <device Dname="EFM32TG11B520F128IM64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128IM64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128IM64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128IM80'  ***************************** -->
        <device Dname="EFM32TG11B520F128IM80">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128IM80"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128IM80.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128IQ48'  ***************************** -->
        <device Dname="EFM32TG11B520F128IQ48">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128IQ48"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128IQ48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128IQ64'  ***************************** -->
        <device Dname="EFM32TG11B520F128IQ64">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128IQ64"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128IQ64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32TG11B520F128IQ80'  ***************************** -->
        <device Dname="EFM32TG11B520F128IQ80">
          <compile header="Device/SiliconLabs/EFM32TG11B/Include/em_device.h"  define="EFM32TG11B520F128IQ80"/>
          <debug      svd="SVD/EFM32TG11B/EFM32TG11B520F128IQ80.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOT1.FLM"  start="0x00000000"  size="0x00020000"  RAMstart="0x20000000" RAMsize="0x2000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOT1.flash"  start="0x00000000"  size="0x00020000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

